# データをまとめるgroupby

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
df = DataFrame({'k1': ['X', 'X', 'Y', 'Y', 'Z'],
               'k2':['a', 'b', 'a', 'b', 'a'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})

In [3]:
df

   dataset1  dataset2 k1 k2
0  0.273143 -0.332501  X  a
1  0.868529 -0.542082  X  b
2 -0.664700 -0.429261  Y  a
3 -1.255996 -1.026587  Y  b
4 -1.104068 -0.345049  Z  a

In [4]:
group1 = df['dataset1'].groupby(df['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X    0.570836
Y   -0.960348
Z   -1.104068
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [9]:
df

   dataset1  dataset2 k1 k2
0  0.273143 -0.332501  X  a
1  0.868529 -0.542082  X  b
2 -0.664700 -0.429261  Y  a
3 -1.255996 -1.026587  Y  b
4 -1.104068 -0.345049  Z  a

In [11]:
df['dataset1'].groupby([cities, month]).mean()

LA  FEB    0.868529
    JAN   -0.664700
NY  FEB   -1.255996
    JAN   -0.415463
Name: dataset1, dtype: float64

In [13]:
df

   dataset1  dataset2 k1 k2
0  0.273143 -0.332501  X  a
1  0.868529 -0.542082  X  b
2 -0.664700 -0.429261  Y  a
3 -1.255996 -1.026587  Y  b
4 -1.104068 -0.345049  Z  a

## dfをk1の列でまとめて、平均をとる

In [14]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.570836 -0.437292
Y  -0.960348 -0.727924
Z  -1.104068 -0.345049

# 複数の列をリストで渡す

In [15]:
df.groupby(['k1', 'k2']).mean()

       dataset1  dataset2
k1 k2
X  a   0.273143 -0.332501
   b   0.868529 -0.542082
Y  a  -0.664700 -0.429261
   b  -1.255996 -1.026587
Z  a  -1.104068 -0.345049

## 出力する列を限定

In [16]:
df2 = df.groupby(['k1', 'k2'])[['dataset2']]

In [17]:
df2.mean()

       dataset2
k1 k2
X  a  -0.332501
   b  -0.542082
Y  a  -0.429261
   b  -1.026587
Z  a  -0.345049

In [18]:
df.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [19]:
for name, group in df.groupby('k1'):
    print('This is {} group'.format(name))
    print(group)
    print('\n')

This is X group
   dataset1  dataset2 k1 k2
0  0.273143 -0.332501  X  a
1  0.868529 -0.542082  X  b


This is Y group
   dataset1  dataset2 k1 k2
2 -0.664700 -0.429261  Y  a
3 -1.255996 -1.026587  Y  b


This is Z group
   dataset1  dataset2 k1 k2
4 -1.104068 -0.345049  Z  a

In [21]:
for (k1, k2), group in df.groupby(['k1', 'k2']):
    print('k1={} k2={}'.format(k1, k2))
    print(group)
    print('\n')

k1=X k2=a
   dataset1  dataset2 k1 k2
0  0.273143 -0.332501  X  a


k1=X k2=b
   dataset1  dataset2 k1 k2
1  0.868529 -0.542082  X  b


k1=Y k2=a
   dataset1  dataset2 k1 k2
2   -0.6647 -0.429261  Y  a


k1=Y k2=b
   dataset1  dataset2 k1 k2
3 -1.255996 -1.026587  Y  b


k1=Z k2=a
   dataset1  dataset2 k1 k2
4 -1.104068 -0.345049  Z  a

In [22]:
gr = df.groupby('k1')

In [23]:
gr.get_group('X')

   dataset1  dataset2 k1 k2
0  0.273143 -0.332501  X  a
1  0.868529 -0.542082  X  b

In [25]:
group_dict = dict(list(df.groupby('k1')))

In [26]:
group_dict['X']

   dataset1  dataset2 k1 k2
0  0.273143 -0.332501  X  a
1  0.868529 -0.542082  X  b

In [27]:
group_dict

{'X':    dataset1  dataset2 k1 k2
 0  0.273143 -0.332501  X  a
 1  0.868529 -0.542082  X  b, 'Y':    dataset1  dataset2 k1 k2
 2 -0.664700 -0.429261  Y  a
 3 -1.255996 -1.026587  Y  b, 'Z':    dataset1  dataset2 k1 k2
 4 -1.104068 -0.345049  Z  a}

In [28]:
group_dict_axis1 = dict(list(df.groupby(df.dtypes, axis=1)))

In [29]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.273143 -0.332501
 1  0.868529 -0.542082
 2 -0.664700 -0.429261
 3 -1.255996 -1.026587
 4 -1.104068 -0.345049, dtype('O'):   k1 k2
 0  X  a
 1  X  b
 2  Y  a
 3  Y  b
 4  Z  a}

In [30]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [31]:
animals = DataFrame(np.arange(16).reshape((4, 4)),
                   columns=['W', 'X', 'Y', 'Z'],
                   index=['dog', 'cat', 'bird', 'mouse'])

In [32]:
animals

        W   X   Y   Z
dog     0   1   2   3
cat     4   5   6   7
bird    8   9  10  11
mouse  12  13  14  15

In [35]:
animals.loc[1:2, ['W', 'Y']] = np.nan

In [36]:
animals

          W   X     Y   Z
dog     0.0   1   2.0   3
cat     NaN   5   NaN   7
bird    8.0   9  10.0  11
mouse  12.0  13  14.0  15

In [37]:
behavior_map = {'W': 'bad', 'X': 'good', 'Y': 'bad', 'Z': 'good'}

In [38]:
animals_col = animals.groupby(behavior_map, axis=1)

In [40]:
animals_col.sum()

        bad  good
dog     2.0   4.0
cat     NaN  12.0
bird   18.0  20.0
mouse  26.0  28.0

In [42]:
behavior_ser = Series(behavior_map)

In [43]:
behavior_ser

W     bad
X    good
Y     bad
Z    good
dtype: object

In [45]:
animals.groupby(behavior_ser, axis=1).count()

       bad  good
dog      2     2
cat      0     2
bird     2     2
mouse    2     2

In [46]:
animals

          W   X     Y   Z
dog     0.0   1   2.0   3
cat     NaN   5   NaN   7
bird    8.0   9  10.0  11
mouse  12.0  13  14.0  15

In [48]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [50]:
keys = ['A', 'B', 'A', 'B']
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15